# encoding: utf-8
# language: ru

Функционал: Вычисление возраста человека в месяцах
	Как кадровик
	Хочу получать количество месяцев в возрасте человека
	Чтобы тратить меньше времени

Сценарий: подсчет возраста когда дата рождения равна 31.03.1991 а дата расчета равна 04.09.2016
	Допустим у меня есть дата рождения человека равная 31.03.1991
	И у меня есть дата расчета возраста в месяцах равная 04.09.2016
	Тогда результат подсчета месяцев в возрасте 305

Сценарий: подсчет возраста когда дата рождения равна 30.06.1981 а дата расчета равна 04.09.2016
	Допустим у меня есть дата рождения человека равная 30.06.1981
	И у меня есть дата расчета возраста в месяцах равная 04.09.2016
	Тогда результат подсчета месяцев в возрасте 421