//начало текста модуля

///////////////////////////////////////////////////
//Служебные функции и процедуры
///////////////////////////////////////////////////

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"_()","_","Допустим");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьДатаРожденияЧеловекаРавная(Парам01)","УМеняЕстьДатаРожденияЧеловекаРавная","Допустим у меня есть дата рождения человека равная 31.03.1991");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"УМеняЕстьДатаРасчетаВозрастаВМесяцахРавная(Парам01)","УМеняЕстьДатаРасчетаВозрастаВМесяцахРавная","И у меня есть дата расчета возраста в месяцах равная 04.09.2016");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"РезультатПодсчетаМесяцевВВозрасте(Парам01)","РезультатПодсчетаМесяцевВВозрасте","Тогда результат подсчета месяцев в возрасте 305");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции



///////////////////////////////////////////////////
//Работа со сценариями
///////////////////////////////////////////////////

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры



///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Допустим
//@_()
Процедура _() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

//окончание текста модуля

&НаКлиенте
//Допустим у меня есть дата рождения человека равная 31.03.1991
//@УМеняЕстьДатаРожденияЧеловекаРавная(Парам01)
Процедура УМеняЕстьДатаРожденияЧеловекаРавная(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И у меня есть дата расчета возраста в месяцах равная 04.09.2016
//@УМеняЕстьДатаРасчетаВозрастаВМесяцахРавная(Парам01)
Процедура УМеняЕстьДатаРасчетаВозрастаВМесяцахРавная(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда результат подсчета месяцев в возрасте 305
//@РезультатПодсчетаМесяцевВВозрасте(Парам01)
Процедура РезультатПодсчетаМесяцевВВозрасте(Парам01) Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры
